Функция ПолучитьПеременнуюСредыИлиЗначение(ИмяПеременной, ЗначениеПоУмолчанию) Экспорт
	ПеременнаяСреды = ПолучитьПеременнуюСреды(ИмяПеременной);
	Если ПеременнаяСреды = Неопределено Тогда
		ПеременнаяСреды = ЗначениеПоУмолчанию;
	КонецЕсли;

	Возврат ПеременнаяСреды;
КонецФункции

Процедура УдалитьТаблицыВБазеДанных(Коннектор) Экспорт
	ТекстЗапроса = "DROP SCHEMA public CASCADE; CREATE SCHEMA public;";
	Коннектор.ВыполнитьЗапрос(ТекстЗапроса);
КонецПроцедуры

Процедура СохранитьСущностьСоВсемиТипамиКолонок(Коннектор, ОбъектМодели, Идентификатор) Экспорт

	Сущность = Новый СущностьСоВсемиТипамиКолонок;
	Сущность.Целое = Идентификатор;
	Коннектор.Сохранить(ОбъектМодели, Сущность);

КонецПроцедуры

// Выполняет запрос коннектором менеджера или хранилища сущностей.
//
// Параметры:
//   ОбъектСПулом - МенеджерСущностей, ХранилищеСущностей - Объект, у которого берется коннектор.
//   ТекстЗапроса - Строка - Текст запроса.
//
// Возвращаемое значение:
//   Произвольный - Результат запроса.
//
Функция ВыполнитьЗапрос(ОбъектСПулом, Знач ТекстЗапроса) Экспорт

	Возврат ОбъектСПулом.ВычислитьСКоннектором(
		"Коннектор -> Коннектор.ВыполнитьЗапрос(Запрос)",
		Новый Структура("Запрос", ТекстЗапроса)
	);

КонецФункции

// Удаляет таблицы в базе данных менеджера сущностей.
//
// Параметры:
//   ОбъектСПулом - МенеджерСущностей - Объект, у которого берется коннектор.
//
Процедура СброситьТаблицы(ОбъектСПулом) Экспорт

	ОбъектСПулом.ВыполнитьСКоннектором(
		"Коннектор -> Коннектор.ВыполнитьЗапрос(Запрос)",
		Новый Структура("Запрос", "DROP SCHEMA public CASCADE; CREATE SCHEMA public;")
	);

КонецПроцедуры
