#Использовать ".."

Перем МенеджерСущностей;

Процедура ПередЗапускомТеста() Экспорт
	МенеджерСущностей = Новый МенеджерСущностей(Тип("КоннекторSQLite"));
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	МенеджерСущностей.Закрыть();
	МенеджерСущностей = Неопределено;
КонецПроцедуры

&Тест
Процедура КоннекторSQLiteРеализуетИнтерфейсКоннектора() Экспорт
	// TODO: Рефакторинг
	МенеджерСущностей = Новый МенеджерСущностей(Тип("КоннекторSQLite"));
КонецПроцедуры

// TODO: Больше тестов на непосредственно коннектор
