#Использовать ".."

#Использовать asserts

&Тест
Процедура КонструкторОбъектаМоделиКорректноАнализируетКласс() Экспорт
	ПодключитьСценарий(ОбъединитьПути(ТекущийКаталог(), "tests", "fixtures", "Автор.os"), "Автор");
	ПодключитьСценарий(ОбъединитьПути(ТекущийКаталог(), "tests", "fixtures", "СущностьБезГенерируемогоИдентификатора.os"), "СущностьБезГенерируемогоИдентификатора");
	
	ОбъектМодели = Новый ОбъектМодели(Тип("Автор"), Неопределено);
	
	Ожидаем.Что(ОбъектМодели.ИмяТаблицы(), "Имя таблицы определено корректно").Равно("Авторы");
	
	Ожидаем.Что(ОбъектМодели.Колонки(), "Сущность имеет четыре колонки").ИмеетДлину(4);
	
	Идентификатор = ОбъектМодели.Идентификатор(); 
	Ожидаем.Что(Идентификатор, "Таблица имеет идентификатор").Не_().Равно(Неопределено);

	Ожидаем.Что(Идентификатор.ИмяПоля, "Идентификатор таблицы указывает на корректное поле").Равно("ВнутреннийИдентификатор");
	Ожидаем.Что(Идентификатор.ИмяКолонки, "Идентификатор таблицы имеет корректное имя колонки").Равно("Идентификатор");
	Ожидаем.Что(Идентификатор.ТипКолонки, "Идентификатор таблицы имеет корректный тип колонки").Равно(ТипыКолонок.Целое);
	Ожидаем.Что(Идентификатор.ГенерируемоеЗначение, "Идентификатор таблицы имеет флаг автоинкремента").Равно(Истина);
	Ожидаем.Что(Идентификатор.ГенерируемоеЗначение, "Идентификатор таблицы имеет флаг идентификатора").Равно(Истина);
	
	Колонки = ОбъектМодели.Колонки();
	Ожидаем.Что(Колонки[0].ИмяПоля, "Первая колонка - внутренний идентификатор").Равно("ВнутреннийИдентификатор");

	Ожидаем.Что(Колонки[1].ИмяПоля, "Вторая колонка - Имя").Равно("Имя");
	Ожидаем.Что(Колонки[1].ИмяКолонки, "Имя поля второй колонки корректно").Равно("Имя");
	Ожидаем.Что(Колонки[1].ТипКолонки, "Тип второй колонки корректен").Равно(ТипыКолонок.Строка);
	
	Ожидаем.Что(Колонки[2].ИмяПоля, "Третья колонка - ВтороеИмя").Равно("ВтороеИмя");
	Ожидаем.Что(Колонки[2].ИмяКолонки, "Имя третье колонки корректно").Равно("Фамилия");
	Ожидаем.Что(Колонки[2].ТипКолонки, "Тип третьей колонки корректен").Равно(ТипыКолонок.Строка);

	Ожидаем.Что(Колонки[3].ИмяКолонки, "Четвертая колонка - ВнешняяСущность").Равно("ВнешняяСущность");
	Ожидаем.Что(Колонки[3].ТипКолонки, "Тип четвертой колонки корректен").Равно(ТипыКолонок.Ссылка);
	Ожидаем.Что(Колонки[3].ТипЭлемента, "Тип элемента четвертой колонки определился").Равно(Тип("СущностьБезГенерируемогоИдентификатора"));

КонецПроцедуры
