#Использовать ".."

&Тест
Процедура ОтборДобавляется() Экспорт
	
	// Дано
	ОпцииПоиска = Новый ОпцииПоиска();
	Ожидаем.Что(ОпцииПоиска.Отборы().Количество()).Равно(0);

	// Когда
	ОпцииПоиска.Отбор("Поле", ВидСравнения.Равно, "Значение");

	// Тогда
	Ожидаем.Что(ОпцииПоиска.Отборы().Количество()).Равно(1);
	Ожидаем.Что(ОпцииПоиска.Отборы()[0].ПутьКДанным).Равно("Поле");
	Ожидаем.Что(ОпцииПоиска.Отборы()[0].ВидСравнения).Равно(ВидСравнения.Равно);
	Ожидаем.Что(ОпцииПоиска.Отборы()[0].Значение).Равно("Значение");

КонецПроцедуры

&Тест
Процедура СортировкаДобавляется() Экспорт

	// Дано
	ОпцииПоиска = Новый ОпцииПоиска();
	Ожидаем.Что(ОпцииПоиска.Сортировки().Количество()).Равно(0);

	// Когда
	ОпцииПоиска.СортироватьПо("Поле", НаправлениеСортировки.Возр);

	// Тогда
	Ожидаем.Что(ОпцииПоиска.Сортировки().Количество()).Равно(1);
	Ожидаем.Что(ОпцииПоиска.Сортировки()[0].ПутьКДанным).Равно("Поле");
	Ожидаем.Что(ОпцииПоиска.Сортировки()[0].НаправлениеСортировки).Равно(НаправлениеСортировки.Возр);

КонецПроцедуры