#Использовать "../.."

// Слой данных задачника. Вся работа с БД сосредоточена здесь:
// бизнес-слой (приложение.os) использует только методы этого класса.

Перем Менеджер;

Процедура ПриСозданииОбъекта(Знач КаталогДанных)
	ОписаниеКаталога = Новый Файл(КаталогДанных);
	Если НЕ ОписаниеКаталога.Существует() Тогда
		СоздатьКаталог(КаталогДанных);
	КонецЕсли;

	Менеджер = Новый МенеджерСущностей(Тип("КоннекторJSON"), КаталогДанных);
	Менеджер.ДобавитьКлассВМодель(Тип("Задача"));

	// Версия схемы данных этой версии приложения
	Менеджер.УстановитьВерсиюСхемы("1.0.0");

	// Анализ схемы БД, приведение ее к состоянию модели, вызов обработчиков миграции
	Менеджер.Инициализировать();
КонецПроцедуры

Функция ДобавитьЗадачу(Знач Имя) Экспорт
	Задача = Новый Задача;
	Задача.Имя = Имя;
	Задача.Выполнена = Ложь;
	Менеджер.Сохранить(Задача);

	Возврат Задача;
КонецФункции

Функция ВсеЗадачи() Экспорт
	Возврат Менеджер.Получить(Тип("Задача"));
КонецФункции

Функция ВерсияСхемыВБазе() Экспорт
	Возврат Менеджер.ПолучитьМиграторСхемы().ХранимаяВерсияСхемы();
КонецФункции

Процедура Закрыть() Экспорт
	Менеджер.Закрыть();
КонецПроцедуры
