// Виды изменений схемы БД, вычисляемые при сравнении модели данных с фактической схемой БД.

Перем СозданиеТаблицы Экспорт;
Перем ДобавлениеКолонки Экспорт;
Перем ИзменениеТипаКолонки Экспорт;
Перем УдалениеКолонки Экспорт;

Перем Виды;

// Возвращает все виды изменений схемы.
//
//  Возвращаемое значение:
//   Массив - Массив строковых представлений видов изменений схемы.
//
Функция Виды() Экспорт
	Возврат Виды;
КонецФункции

СозданиеТаблицы = "СозданиеТаблицы";
ДобавлениеКолонки = "ДобавлениеКолонки";
ИзменениеТипаКолонки = "ИзменениеТипаКолонки";
УдалениеКолонки = "УдалениеКолонки";

Виды = Новый Массив;
Виды.Добавить(СозданиеТаблицы);
Виды.Добавить(ДобавлениеКолонки);
Виды.Добавить(ИзменениеТипаКолонки);
Виды.Добавить(УдалениеКолонки);
