Перем Массив Экспорт;
Перем Структура Экспорт;

// ФиксированныйМассив - Все типы подчиненных таблиц.
Перем Типы;

// Возвращает все типы подчиненных таблиц.
//
// Возвращаемое значение:
//   ФиксированныйМассив из Строка - Имена типов подчиненных таблиц.
//
Функция Типы() Экспорт
	Возврат Типы;
КонецФункции

Массив = "Массив";
Структура = "Структура";

ВсеТипы = Новый Массив;
ВсеТипы.Добавить(Массив);
ВсеТипы.Добавить(Структура);
Типы = Новый ФиксированныйМассив(ВсеТипы);
