Перем ВнутреннийИдентификатор Экспорт;

Перем Имя Экспорт;
Перем ВтороеИмя Экспорт;

Перем ВнешняяСущность Экспорт;

&Сущность(ИмяТаблицы = "Авторы")
&Идентификатор
&ГенерируемоеЗначение
&Колонка(ИмяПоля = "ВнутреннийИдентификатор", Имя = "Идентификатор", Тип = "Целое")
&Колонка(ИмяПоля = "Имя")
&Колонка(ИмяПоля = "ВтороеИмя", Имя = "Фамилия")
&Колонка(ИмяПоля = "ВнешняяСущность", Тип = "Ссылка", ТипСсылки = "СущностьБезГенерируемогоИдентификатора")
Процедура ПриСозданииОбъекта() Экспорт

КонецПроцедуры
