&Колонка(Тип = "Целое")
&Идентификатор
Перем Целое Экспорт;

&Колонка(Тип = "Дробное")
Перем Дробное Экспорт;

&Колонка(Тип = "Строка")
Перем Строка Экспорт;

&Колонка(Тип = "Булево")
Перем БулевоИстина Экспорт;

&Колонка(Тип = "Булево")
Перем БулевоЛожь Экспорт;

&Колонка(Тип = "Дата")
Перем Дата Экспорт;

&Колонка(Тип = "Время")
Перем Время Экспорт;

&Колонка(Тип = "ДатаВремя")
Перем ДатаВремя Экспорт;

&Колонка(Тип = "Ссылка", ТипСсылки = "СущностьСоВсемиТипамиКолонок")
Перем Ссылка Экспорт;

&ПодчиненнаяТаблица(Тип = "Массив", ТипЭлемента = "Строка")
Перем Массив Экспорт;

&ПодчиненнаяТаблица(Тип = "Структура", ТипЭлемента = "Строка")
Перем Структура Экспорт;

&ПодчиненнаяТаблица(Тип = "Массив", ТипЭлемента = "СущностьСоВсемиТипамиКолонок")
Перем МассивСсылок Экспорт;

&Сущность
Процедура ПриСозданииОбъекта()

КонецПроцедуры
