#Использовать sql

Функция НовыйСоединение() Экспорт
	
	Соединение = Новый Соединение();
	Возврат Соединение;

КонецФункции

Процедура Открыть(Соединение, СтрокаСоединения) Экспорт

	Соединение.ТипСУБД = Соединение.ТипыСУБД.PostgreSQL;
	Соединение.СтрокаСоединения = СтрокаСоединения;
	Соединение.Открыть();
	
КонецПроцедуры

Процедура Закрыть(Соединение) Экспорт
	Соединение.Закрыть();
КонецПроцедуры

Функция НовыйЗапрос(Соединение) Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьСоединение(Соединение);
	Возврат Запрос;
КонецФункции
